In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data=pd.read_csv('data/201901-202003.csv')

In [3]:
clss_lst = data['STD_CLSS_NM'].unique()

In [4]:
for i in clss_lst:
    print(i)

건강보조식품 소매업
골프장 운영업
과실 및 채소 소매업
관광 민예품 및 선물용품 소매업
그외 기타 스포츠시설 운영업
그외 기타 종합 소매업
기타 대형 종합 소매업
기타 외국식 음식점업
기타 주점업
기타음식료품위주종합소매업
마사지업
비알콜 음료점업
빵 및 과자류 소매업
서양식 음식점업
수산물 소매업
슈퍼마켓
스포츠 및 레크레이션 용품 임대업
여관업
욕탕업
육류 소매업
일반유흥 주점업
일식 음식점업
전시 및 행사 대행업
중식 음식점업
차량용 가스 충전업
차량용 주유소 운영업
체인화 편의점
피자 햄버거 샌드위치 및 유사 음식점업
한식 음식점업
호텔업
화장품 및 방향제 소매업
휴양콘도 운영업
여행사업
자동차 임대업
면세점
버스 운송업
택시 운송업
기타 수상오락 서비스업
내항 여객 운송업
그외 기타 분류안된 오락관련 서비스업
정기 항공 운송업

In [5]:
len(data['STD_CLSS_NM'].unique())

41

### 면세점은 데이터가 없음

## 운송업

In [84]:
us = pd.read_csv("data/unsong.csv", encoding = "euc-kr")

In [85]:
us

         산업별  매출액규모별       2018
0        산업별  매출액규모별  매출액 (백만원)
1         총계      합계  146931941
2   시내버스 운송업      합계    6585631
3   시외버스 운송업      합계    1905755
4     택시 운송업      합계    8568071
5  내항 여객 운송업      합계     311636
6  항공 여객 운송업      합계   20271733

In [86]:
us = us.loc[2:]
us.drop("매출액규모별", axis = 1, inplace = True)
us.rename(columns={"2018" : "매출액"}, inplace = True)
us.head()

/Users/jominju/opt/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:3997: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,
/Users/jominju/opt/anaconda3/lib/python3.7/site-packages/pandas/core/frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

         산업별       매출액
2   시내버스 운송업   6585631
3   시외버스 운송업   1905755
4     택시 운송업   8568071
5  내항 여객 운송업    311636
6  항공 여객 운송업  20271733

In [87]:
us = us.append({"산업별" : "버스 운송업", "매출액" : int(us.iloc[0,1]) + int(us.iloc[1,1])}, ignore_index = True)
us

         산업별       매출액
0   시내버스 운송업   6585631
1   시외버스 운송업   1905755
2     택시 운송업   8568071
3  내항 여객 운송업    311636
4  항공 여객 운송업  20271733
5     버스 운송업   8491386

In [88]:
us.drop([0,1], inplace = True)
us.reset_index(inplace = True, drop = True)
us

         산업별       매출액
0     택시 운송업   8568071
1  내항 여객 운송업    311636
2  항공 여객 운송업  20271733
3     버스 운송업   8491386

In [89]:
us["산업별"][us["산업별"] == "항공 여객 운송업"] = "정기 항공 운송업"
us

         산업별       매출액
0     택시 운송업   8568071
1  내항 여객 운송업    311636
2  정기 항공 운송업  20271733
3     버스 운송업   8491386

## 소매, 음식업

In [90]:
sm_food = pd.read_csv("data/somae_food.csv", encoding = "euc-kr")

In [91]:
sm_food.head()

   시도별                 산업별  매출액규모별      2016
0  시도별                 산업별  매출액규모별  매출액(백만원)
1   전국        기타 대형 종합 소매업      총계  41104330
2   전국                슈퍼마켓      총계  36231039
3   전국             체인화 편의점      총계  20253703
4   전국  기타 음·식료품 위주 종합 소매업      총계  11044720

In [92]:
sm_food.drop("매출액규모별", axis = 1, inplace = True)
sm_food = sm_food.loc[1:]
sm_food = sm_food[sm_food["시도별"] != "전국"]

In [93]:
sm_food.head(10)

      시도별                 산업별      2016
27  서울특별시        기타 대형 종합 소매업  11790872
28  서울특별시                슈퍼마켓   6097608
29  서울특별시             체인화 편의점   5628865
30  서울특별시  기타 음·식료품 위주 종합 소매업   2212721
31  서울특별시        그외 기타 종합 소매업    970747
32  서울특별시              육류 소매업   1405284
33  서울특별시             수산물 소매업    435467
34  서울특별시         과실 및 채소 소매업    813708
35  서울특별시         빵 및 과자류 소매업    128047
36  서울특별시          건강보조식품 소매업   1014807

In [94]:
sm_food.reset_index(drop = True, inplace = True)
sm_food.head()

     시도별                 산업별      2016
0  서울특별시        기타 대형 종합 소매업  11790872
1  서울특별시                슈퍼마켓   6097608
2  서울특별시             체인화 편의점   5628865
3  서울특별시  기타 음·식료품 위주 종합 소매업   2212721
4  서울특별시        그외 기타 종합 소매업    970747

## 기타

In [95]:
gt = pd.read_csv("data/gita.csv", encoding = "euc-kr")

In [96]:
gt.head()

   시도별                 산업별  매출액규모별       2016
0  시도별                 산업별  매출액규모별  매출액 (백만원)
1   전국             자동차 임대업      총계    5428294
2   전국  스포츠 및 레크레이션 용품 임대업      총계     128847
3   전국                여행사업      총계    3812948
4   전국         전시 및 행사 대행업      총계    2231055

In [97]:
gt.drop("매출액규모별", axis = 1, inplace = True)
gt = gt.loc[1:]
gt = gt[gt["시도별"] != "전국"]

In [98]:
gt.head()

      시도별                 산업별     2016
11  서울특별시             자동차 임대업  2871971
12  서울특별시  스포츠 및 레크레이션 용품 임대업    16334
13  서울특별시                여행사업  2522901
14  서울특별시         전시 및 행사 대행업  1436160
15  서울특별시             골프장 운영업    11388

In [99]:
gt.reset_index(drop = True, inplace = True)
gt.head()

     시도별                 산업별     2016
0  서울특별시             자동차 임대업  2871971
1  서울특별시  스포츠 및 레크레이션 용품 임대업    16334
2  서울특별시                여행사업  2522901
3  서울특별시         전시 및 행사 대행업  1436160
4  서울특별시             골프장 운영업    11388

In [100]:
gt["시도별"].unique()

array(['서울특별시', '부산광역시', '대구광역시', '인천광역시', '광주광역시', '대전광역시', '울산광역시',
       '세종특별자치시', '경기도', '강원도', '충청북도', '충청남도', '전라북도', '전라남도', '경상북도',
       '경상남도', '제주특별자치도'], dtype=object)

In [101]:
def sido_tidy(sm_food):    
    sm_food["시도별"][sm_food["시도별"].str.len()>4] = sm_food["시도별"][sm_food["시도별"].str.len()>4].str[:2]
    sm_food["시도별"] = sm_food["시도별"].str.replace("도","")
    sm_food["시도별"] = sm_food["시도별"].str.replace("청","")
    sm_food["시도별"] = sm_food["시도별"].str.replace("상","")
    sm_food["시도별"] = sm_food["시도별"].str.replace("라","")

In [102]:
sido_tidy(sm_food)
sido_tidy(gt)

In [103]:
sm_food["시도별"].unique()

array(['서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', '경기', '강원', '충북',
       '충남', '전북', '전남', '경북', '경남', '제주'], dtype=object)

In [104]:
gt["시도별"].unique()

array(['서울', '부산', '대구', '인천', '광주', '대전', '울산', '세종', '경기', '강원', '충북',
       '충남', '전북', '전남', '경북', '경남', '제주'], dtype=object)

In [105]:
sm_food.head()

  시도별                 산업별      2016
0  서울        기타 대형 종합 소매업  11790872
1  서울                슈퍼마켓   6097608
2  서울             체인화 편의점   5628865
3  서울  기타 음·식료품 위주 종합 소매업   2212721
4  서울        그외 기타 종합 소매업    970747

In [106]:
gt.head()

  시도별                 산업별     2016
0  서울             자동차 임대업  2871971
1  서울  스포츠 및 레크레이션 용품 임대업    16334
2  서울                여행사업  2522901
3  서울         전시 및 행사 대행업  1436160
4  서울             골프장 운영업    11388

In [107]:
sm_food.rename(columns = {"시도별" : "CARD_SIDO_NM", "산업별" : "STD_CLSS_NM", "2016" : "Maechul"}, inplace = True)
gt.rename(columns = {"시도별" : "CARD_SIDO_NM", "산업별" : "STD_CLSS_NM", "2016" : "Maechul"}, inplace = True)
us.rename(columns = {"산업별" : "STD_CLSS_NM", "매출액" : "Maechul"}, inplace = True)

In [108]:
sm_food

    CARD_SIDO_NM              STD_CLSS_NM   Maechul
0             서울             기타 대형 종합 소매업  11790872
1             서울                     슈퍼마켓   6097608
2             서울                  체인화 편의점   5628865
3             서울       기타 음·식료품 위주 종합 소매업   2212721
4             서울             그외 기타 종합 소매업    970747
..           ...                      ...       ...
437           제주              기타 외국식 음식점업      3447
438           제주  피자  햄버거  샌드위치 및 유사 음식점업     61595
439           제주                 일반유흥 주점업    175176
440           제주                   기타 주점업    108519
441           제주                 비알콜 음료점업    124909

[442 rows x 3 columns]

In [109]:
gt

    CARD_SIDO_NM           STD_CLSS_NM  Maechul
0             서울               자동차 임대업  2871971
1             서울    스포츠 및 레크레이션 용품 임대업    16334
2             서울                  여행사업  2522901
3             서울           전시 및 행사 대행업  1436160
4             서울               골프장 운영업    11388
..           ...                   ...      ...
165           제주       그외 기타 스포츠시설 운영업    10140
166           제주          기타 수상오락 서비스업     1378
167           제주  그외 기타 분류안된 오락관련 서비스업     9304
168           제주                   욕탕업    23464
169           제주                  마사지업     7894

[170 rows x 3 columns]

In [110]:
us

  STD_CLSS_NM   Maechul
0      택시 운송업   8568071
1   내항 여객 운송업    311636
2   정기 항공 운송업  20271733
3      버스 운송업   8491386

In [112]:
clss_lst

array(['건강보조식품 소매업', '골프장 운영업', '과실 및 채소 소매업', '관광 민예품 및 선물용품 소매업',
       '그외 기타 스포츠시설 운영업', '그외 기타 종합 소매업', '기타 대형 종합 소매업', '기타 외국식 음식점업',
       '기타 주점업', '기타음식료품위주종합소매업', '마사지업', '비알콜 음료점업', '빵 및 과자류 소매업',
       '서양식 음식점업', '수산물 소매업', '슈퍼마켓', '스포츠 및 레크레이션 용품 임대업', '여관업', '욕탕업',
       '육류 소매업', '일반유흥 주점업', '일식 음식점업', '전시 및 행사 대행업', '중식 음식점업',
       '차량용 가스 충전업', '차량용 주유소 운영업', '체인화 편의점', '피자 햄버거 샌드위치 및 유사 음식점업',
       '한식 음식점업', '호텔업', '화장품 및 방향제 소매업', '휴양콘도 운영업', '여행사업', '자동차 임대업',
       '면세점', '버스 운송업', '택시 운송업', '기타 수상오락 서비스업', '내항 여객 운송업',
       '그외 기타 분류안된 오락관련 서비스업', '정기 항공 운송업'], dtype=object)

In [113]:
sm_lst = sm_food["STD_CLSS_NM"].unique()
gt_lst = gt["STD_CLSS_NM"].unique()
us_lst = us["STD_CLSS_NM"].unique()

In [114]:
def detect_lst(lst):
    for i in lst:
        if i not in clss_lst:
            print(i)

In [115]:
detect_lst(sm_lst)

기타 음·식료품 위주 종합 소매업
피자  햄버거  샌드위치 및 유사 음식점업

In [116]:
detect_lst(gt_lst)

In [117]:
detect_lst(us_lst)

In [118]:
sm_food["STD_CLSS_NM"][sm_food["STD_CLSS_NM"]=="기타 음·식료품 위주 종합 소매업"] = "기타음식료품위주종합소매업"
sm_food["STD_CLSS_NM"][sm_food["STD_CLSS_NM"]=="피자  햄버거  샌드위치 및 유사 음식점업"] = "피자 햄버거 샌드위치 및 유사 음식점업"

In [119]:
sm_lst = sm_food["STD_CLSS_NM"].unique()
gt_lst = gt["STD_CLSS_NM"].unique()
us_lst = us["STD_CLSS_NM"].unique()

In [120]:
detect_lst(sm_lst)
detect_lst(gt_lst)
detect_lst(us_lst)

In [121]:
sm_food.to_csv("sm_food_cleaned.csv")
gt.to_csv("gt_cleaned.csv")
us.to_csv("us_cleaned.csv")